data/cae_te_workspace/experiments/openfoam/resin_fill_v005/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| Gravity (disabled for horizontal cavity-fill proxy; enable in Phase 3)      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];
value           (0 0 0);

// ************************************************************************* //
