data/cae_te_workspace/experiments/openfoam/resin_fill_v005/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet1
    {
        type            patch;
        nFaces          3;
        startFace       940;
    }
    inlet2
    {
        type            patch;
        nFaces          4;
        startFace       943;
    }
    inlet3
    {
        type            patch;
        nFaces          3;
        startFace       947;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       950;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       960;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1000;
        startFace       1060;
    }
)

// ************************************************************************* //
