data/cae_te_workspace/experiments/openfoam/resin_fill_v005/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| Moldflow Phase 4: RAS k-omega SST (runner/cooling proxy on box cavity)      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
